In [5]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/grade.csv')

In [6]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  10 non-null     int64
 1   name        10 non-null     object
 2   gender      10 non-null     object
 3   midterm     9 non-null      float64
 4   final       9 non-null      float64
 5   assignment  9 non-null      float64
dtypes: float64(3), int64(1), object(2)
memory usage: 608.0+ bytes
None

In [7]:
df[df['midterm'] >= 85]

   student_id     name gender  midterm  final  assignment
0           1    Alice      F     85.0   88.0        95.0
2           3  Charlie      M     92.0   94.0        87.0
3           4    David      M     88.0   90.0        85.0
5           6    Frank      M     95.0   97.0        98.0
6           7    Grace      F     89.0   91.0        84.0
7           8   Hannah      F     90.0   92.0         NaN

In [ ]:
# 3
df.sort_values(by=['final'], ascending=False).head()

   student_id     name gender  midterm  final  assignment
5           6    Frank      M     95.0   97.0        98.0
2           3  Charlie      M     92.0   94.0        87.0
7           8   Hannah      F     90.0   92.0         NaN
6           7    Grace      F     89.0   91.0        84.0
3           4    David      M     88.0   90.0        85.0

In [ ]:
#4
df.groupby('gender')[['midterm', 'final']].mean()

        midterm  final
gender
F          85.0   87.5
M          86.0   88.2

In [20]:
# 5

df['student_id'] = df['student_id'].astype('str')
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  10 non-null     object
 1   name        10 non-null     object
 2   gender      10 non-null     object
 3   midterm     9 non-null      float64
 4   final       9 non-null      float64
 5   assignment  9 non-null      float64
dtypes: float64(3), object(3)
memory usage: 608.0+ bytes
None

In [25]:
# 6

print(df['assignment'].idxmin(), df['assignment'].idxmax())

print(df.loc[df['assignment'].idxmax()])
print(df.loc[df['assignment'].idxmin()])

4 5
student_id        6
name          Frank
gender            M
midterm        95.0
final          97.0
assignment     98.0
Name: 5, dtype: object
student_id       5
name           Eve
gender           F
midterm       76.0
final         79.0
assignment    77.0
Name: 4, dtype: object

In [28]:
# 7
df['average'] = df[['midterm', 'final', 'assignment']].mean(axis=1)
print(df)

  student_id     name gender  midterm  final  assignment    average
0          1    Alice      F     85.0   88.0        95.0  89.333333
1          2      Bob      M     78.0   74.0        82.0  78.000000
2          3  Charlie      M     92.0   94.0        87.0  91.000000
3          4    David      M     88.0   90.0        85.0  87.666667
4          5      Eve      F     76.0   79.0        77.0  77.333333
5          6    Frank      M     95.0   97.0        98.0  96.666667
6          7    Grace      F     89.0   91.0        84.0  88.000000
7          8   Hannah      F     90.0   92.0         NaN  91.000000
8          9     Ivan      M     77.0    NaN        81.0  79.000000
9         10     Jack      M      NaN   86.0        88.0  87.000000

In [31]:
# 8

# 결측치 확인
df.isna().sum()
# 결측치 있는 행 제거
df_cleaned = df.dropna()
print(df_cleaned.info())

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 6
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  7 non-null      object
 1   name        7 non-null      object
 2   gender      7 non-null      object
 3   midterm     7 non-null      float64
 4   final       7 non-null      float64
 5   assignment  7 non-null      float64
 6   average     7 non-null      float64
dtypes: float64(4), object(3)
memory usage: 448.0+ bytes
None

In [33]:
# 9 

additional_data = {
    'student_id': ['1', '3', '5', '7', '9'],
    'club': ['Art', 'Science', 'Math', 'Music', 'Drama']
}
df_additional = pd.DataFrame(additional_data)

# 병합
merged_df = pd.merge(df, df_additional, on='student_id', how='left')

print(merged_df)

  student_id     name gender  midterm  final  assignment    average     club
0          1    Alice      F     85.0   88.0        95.0  89.333333      Art
1          2      Bob      M     78.0   74.0        82.0  78.000000      NaN
2          3  Charlie      M     92.0   94.0        87.0  91.000000  Science
3          4    David      M     88.0   90.0        85.0  87.666667      NaN
4          5      Eve      F     76.0   79.0        77.0  77.333333     Math
5          6    Frank      M     95.0   97.0        98.0  96.666667      NaN
6          7    Grace      F     89.0   91.0        84.0  88.000000    Music
7          8   Hannah      F     90.0   92.0         NaN  91.000000      NaN
8          9     Ivan      M     77.0    NaN        81.0  79.000000    Drama
9         10     Jack      M      NaN   86.0        88.0  87.000000      NaN

In [35]:
# 10

pivot_table = df.pivot_table(values='average', index='gender', columns='student_id')
display(pivot_table)

student_id,1,10,2,3,4,5,6,7,8,9
gender,,,,,,,,,,
F,89.333333,NaN,NaN,NaN,NaN,77.333333,NaN,88.0,91.0,NaN
M,NaN,87.0,78.0,91.0,87.666667,NaN,96.666667,NaN,NaN,79.0

In [ ]:
# 11
df['average'] = df[['midterm', 'final', 'assignment']].mean(axis=1)

melted_df = pd.melt(df, id_vars = ['student_id', 'name', 'gender'], value_vars = ['assignment', 'average', 'final', 'midterm'], var_name = 'variable', value_name = 'score')

grouped_mean = melted_df.groupby(['gender', 'variable'])['score'].mean().reset_index()
print(grouped_mean)

  gender    variable      score
0      F  assignment  85.333333
1      F     average  86.416667
2      F       final  87.500000
3      F     midterm  85.000000
4      M  assignment  86.833333
5      M     average  86.555556
6      M       final  88.200000
7      M     midterm  86.000000

In [43]:
# 12

max_average_df = df['average'].idxmax()

df.loc[max_average_df][['name', 'average']]

name           Frank
average    96.666667
Name: 5, dtype: object

In [ ]:
# 데이터 로드

import pandas as pd
import numpy as np
train = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/st_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/st_test.csv')

In [45]:
train.info()
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 256 entries, 0 to 255
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   school    256 non-null    object
 1   sex       256 non-null    object
 2   paid      256 non-null    object
 3   famrel    256 non-null    int64
 4   freetime  256 non-null    int64
 5   goout     252 non-null    float64
 6   Dalc      256 non-null    int64
 7   Walc      256 non-null    int64
 8   health    256 non-null    int64
 9   absences  256 non-null    int64
 10  grade     256 non-null    int64
dtypes: float64(1), int64(7), object(3)
memory usage: 22.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 110 entries, 0 to 109
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   school    110 non-null    object
 1   sex       110 non-null    object
 2   paid      110 non-null    object
 3   famrel    110 non-null    int64
 4   freetime  110 non-null    int64
 5   goout     104 non-null    float64
 6   Dalc      110 non-null    int64
 7   Walc      110 non-null    int64
 8   health    110 non-null    int64
 9   absences  110 non-null    int64
 10  grade     110 non-null    int64
dtypes: float64(1), int64(7), object(3)
memory usage: 9.6+ KB

In [49]:
# 데이터 분할
train_X = train.drop(['grade'], axis = 1)
train_y = train['grade']

test_y = test.drop(['grade'], axis = 1)
test_y = train['grade']

from sklearn.model_selection import train_test_split

train_X, valid_X, train_y, valid_y = train_test_split(train_X, train_y, test_size=0.3, random_state= 1)
print(train_X.shape, train_y.shape, valid_X.shape, valid_y.shape)

(179, 10) (179,) (77, 10) (77,)

In [50]:
# 데이터 전처리
cat_columns = train_X.select_dtypes('object').columns.to_list()
num_columns = train_X.select_dtypes('number').columns.to_list()

# 원-핫 인코딩과 평균 대치법을 위한 메서드 불러오기
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer

onehotencoder = OneHotEncoder(sparse_output = False, handle_unknown = 'ignore')
imputer = SimpleImputer()